CSI API ETABS v1

# cLoadCasesStaticNonlinear Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseStaticNonlinear StaticNonlinear { get; }

    ReadOnly Property StaticNonlinear As cCaseStaticNonlinear
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseStaticNonlinear

    value = instance.StaticNonlinear

    property cCaseStaticNonlinear^ StaticNonlinear {
    	cCaseStaticNonlinear^ get ();
    }

    abstract StaticNonlinear : cCaseStaticNonlinear with get

#### Property Value

Type: cCaseStaticNonlinear

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com